-- MySQL dump 10.13  Distrib 5.6.50, for Linux (x86_64)
--
-- Host: localhost    Database: qndxx
-- ------------------------------------------------------
-- Server version	5.6.50-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `access_tokens`
--

DROP TABLE IF EXISTS `access_tokens`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `access_tokens` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `accesstoken` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `access_tokens`
--

LOCK TABLES `access_tokens` WRITE;
/*!40000 ALTER TABLE `access_tokens` DISABLE KEYS */;
INSERT INTO `access_tokens` VALUES (1,'DB5F04E0-725F-42C2-A9FE-F84778897345');
/*!40000 ALTER TABLE `access_tokens` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `branch_data`
--

DROP TABLE IF EXISTS `branch_data`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `branch_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `memberCnt` int(11) DEFAULT NULL,
  `users` varchar(255) DEFAULT NULL,
  `averageScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `branch_data`
--

LOCK TABLES `branch_data` WRITE;
/*!40000 ALTER TABLE `branch_data` DISABLE KEYS */;
INSERT INTO `branch_data` VALUES (1,'环境191',26,'0',0),(2,'环境192',29,'0',0),(3,'环境193',28,'0',0),(4,'安全190',21,'0',0),(5,'能源191',27,'0',0),(6,'能源192',26,'1',3.85),(7,'能源193',23,'0',0),(8,'环社220',30,'29',96.67),(9,'能经220',29,'7',24.14),(10,'能环试验2201',31,'24',77.42),(11,'能环试验2202',30,'30',100),(12,'能环试验2203',32,'27',84.38),(13,'能环试验2204',33,'11',33.33),(14,'能环试验2205',33,'24',72.73),(15,'22博士',29,'0',0),(16,'22硕博',7,'6',85.71),(17,'19级博士班',18,'0',0),(18,'19级硕博班',13,'1',7.69),(19,'22热能硕士',30,'13',43.33),(20,'22环硕',56,'1',1.79),(21,'22专硕',82,'0',0),(22,'环境201',25,'10',40),(23,'环境202',25,'17',68),(24,'环境203',25,'17',68),(25,'能源201',29,'4',13.79),(26,'能源202',31,'14',45.16),(27,'能源203',27,'11',40.74),(28,'20博士',24,'0',0),(29,'20硕博',11,'0',0),(30,'20热能硕士',22,'0',0),(31,'20环硕1班',30,'0',0),(32,'20环硕2班',29,'0',0),(33,'20专硕1班',36,'0',0),(34,'20专硕2班',37,'0',0),(35,'安全200',28,'1',3.57),(36,'安全210',20,'20',100),(37,'环境212',29,'3',10.34),(38,'能源211',29,'12',41.38),(39,'能源212',27,'24',88.89),(40,'环社210',26,'20',76.92),(41,'能经210',28,'1',3.57),(42,'21硕博',11,'1',9.09),(43,'21热能硕士',22,'0',0),(44,'21环硕1班',30,'1',3.33),(45,'21环硕2班',30,'0',0),(46,'21专硕1班',43,'0',0),(47,'21专硕2班',43,'0',0),(48,'21博士',27,'0',0),(49,'环境211',28,'2',7.14);
/*!40000 ALTER TABLE `branch_data` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `captcha`
--

DROP TABLE IF EXISTS `captcha`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `captcha` (
  `id` varchar(100) NOT NULL,
  `captcha` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `captcha`
--

LOCK TABLES `captcha` WRITE;
/*!40000 ALTER TABLE `captcha` DISABLE KEYS */;
INSERT INTO `captcha` VALUES ('6FBCFBE7-A334-40E6-9958-D1C8E7DF7F90','E4ZO');
/*!40000 ALTER TABLE `captcha` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `courses`
--

DROP TABLE IF EXISTS `courses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `courses` (
  `id` varchar(100) NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `courses`
--

LOCK TABLES `courses` WRITE;
/*!40000 ALTER TABLE `courses` DISABLE KEYS */;
INSERT INTO `courses` VALUES ('C0001','第八季第一期'),('C0019','第八季第二期'),('C0021','第八季第三期'),('C0027','第八季第四期'),('C0030','第八季第五期'),('C0034','第八季第六期'),('C0035','第八季第七期'),('C0036','第八季第八期'),('C0048','第八季第九期'),('C0050','第八季第十期'),('C0058','学习电子书'),('C0065','第九季五四特辑'),('C0069','第九季第一期'),('C0073','第九季第二期'),('C0081','第九季第三期'),('C0089','第九季第四期'),('C0090','第九季第五期'),('C0119','第九季第六期'),('C0140','第九季第七期'),('C0155','第九季第八期'),('C0167','第九季第九期'),('C0190','“青年大学习”特辑'),('C0192','第九季第十期'),('C0194','第九季第十一期'),('C0195','第九季第十二期'),('C0196','第九季第十三期'),('C0198','第九季合辑'),('C0199','第十季第一期'),('C0200','第十季第二期'),('C0201','第十季第三期'),('C0202','第十季特辑1'),('C0203','第十季第四期'),('C0204','第十季特辑2'),('C0205','第十季第五期'),('C0208','第十季特辑3'),('C0209','浦东开发开放30周年庆祝大会特辑'),('C0215','第十季第六期'),('C0216','第十季第七期'),('C0217','第十季第八期'),('C0218','第十季第九期'),('C0219','第十季第十期'),('C0240','第十一季第一期'),('C0241','第十一季第二期'),('C0245','第十一季第三期'),('C0246','第十一季第四期'),('C0259','第十一季第五期'),('C0260','第十一季第六期'),('C0266','第十一季第七期'),('C0267','第十一季第八期'),('C0268','第十一季第九期'),('C0269','第十一季第十期'),('C0270','第十一季第十一期'),('C0271','第十一季第十二期'),('C0272','第十一季第十三期'),('C0273','第十一季第十四期'),('C0274','第十一季第十五期'),('C0275','第十一季第十六期'),('C0276','第十一季第十七期'),('C0277','第十一季第十八期'),('C0278','第十一季第十九期'),('C0279','第十一季第二十期'),('C0280','第十二季第一期'),('C0281','第十二季第二期'),('C0283','第十二季第三期'),('C0284','第十二季第四期'),('C0285','第十二季第五期'),('C0286','第十二季第六期'),('C0287','第十二季第七期'),('C0288','第十二季第八期'),('C0289','“青年大学习”特辑'),('C0290','第十二季第九期'),('C0291','第十二季第十期'),('C0292','第十二季第十一期'),('C0293','第十二季第十二期'),('C0294','第十二季第十三期'),('C0295','第十二季第十四期'),('C1003','2022年第2期'),('C1004','2022年第3期'),('C1005','2022年第4期'),('C1006','2022年第5期'),('C1007','2022年第6期'),('C1008','2022年第7期'),('C1009','2022年第8期'),('C1010','2022年第9期'),('C1011','2022年第10期'),('C1012','2022年第11期'),('C1013','2022年第12期'),('C1014','2022年特辑'),('C1015','2022年第13期'),('C1016','2022年第14期'),('C1017','2022年第15期'),('C1018',' 2022年第16期'),('C1019','2022年第17期'),('C1035','2022年第18期'),('C1036','2022年第19期'),('C1037','2022年第20期'),('C1038','2022年第21期'),('C1039','2022年第22期'),('C1040','特辑'),('C1043','特辑'),('C1044','2022年第23期'),('C1045','2022年第24期'),('C1046','2022年第25期'),('C1047','2022年第26期'),('C1048','2022年第27期'),('C1049','2022年第28期'),('C1050','2022年第29期'),('C1054','2022年第30期'),('C1055','2022年第31期'),('C1058','2023年第1期'),('C1059','2023年第2期'),('C1060','2023年第3期'),('C1061','2023年第4期'),('C1062','2023年第5期'),('C1063','2023年第6期'),('C1064','2023年第7期'),('C1065','2023年第8期'),('C1066','2023年第9期'),('C1067','2023年第10期'),('C1068','2023年第11期'),('C1069','2023年第12期'),('C1070','2023年第13期');
/*!40000 ALTER TABLE `courses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `time`
--

DROP TABLE IF EXISTS `time`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `time` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `datetime` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `time`
--

LOCK TABLES `time` WRITE;
/*!40000 ALTER TABLE `time` DISABLE KEYS */;
INSERT INTO `time` VALUES (1,'2023-06-01 09:53:21');
/*!40000 ALTER TABLE `time` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `time2`
--

DROP TABLE IF EXISTS `time2`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `time2` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `datetime` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `time2`
--

LOCK TABLES `time2` WRITE;
/*!40000 ALTER TABLE `time2` DISABLE KEYS */;
INSERT INTO `time2` VALUES (1,'2023-06-01 10:10:00');
/*!40000 ALTER TABLE `time2` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `wxx`
--

DROP TABLE IF EXISTS `wxx`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `wxx` (
  `unit_class` varchar(255) DEFAULT NULL,
  `name_id` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `wxx`
--

LOCK TABLES `wxx` WRITE;
/*!40000 ALTER TABLE `wxx` DISABLE KEYS */;
INSERT INTO `wxx` VALUES ('环社210','石君竹'),('环社210','朱金晨'),('环社210','陈田宇'),('环社210','方欣源'),('环社210','雷郁轩'),('环社210','向奕成'),('能源212','白云芃'),('能源212','陶华洋'),('能源212','沈琦程'),('能源212','陈沫岩'),('能源212','旦增旺啦'),('能源212','买吾兰·吐尔汗江'),('环境201','苏俊辉'),('环境201','戴飞'),('环境201','李宇杰'),('环境201','付佳浩'),('环境201','朱英杰'),('环境201','肖南伯'),('环境201','程旸'),('环境201','周嘉榕'),('环境201','王晓雪'),('环境201','陈玉'),('环境201','阿燕·努尔德别克'),('环境201','廖梓卉'),('环境201','邬婧怡'),('环境201','苏秋苗'),('环境201','孜拉来'),('环社220','陈泓锦'),('环社220','赖建涛'),('能环试验2205','郭正恬'),('能环试验2205','李嘉琪'),('能环试验2205','王佳乐'),('能环试验2205','郑业川'),('能环试验2205','闫鑫宇'),('能环试验2205','李家源'),('能环试验2205','贾永建'),('能环试验2205','王思齐'),('能环试验2205','彭麟'),('环境212','张云川'),('环境212','熊嘉浩'),('能经220','顾师源'),('能经220','官心怡'),('能经220','王菲'),('能经220','刘伊婷'),('能经220','杜佳怡'),('能经220','康瑜玲'),('能经220','黄为'),('能经220','吴浩'),('能经220','于洋'),('能经220','李飚'),('能经220','陶珺宇'),('能经220','陈永旺'),('能经220','范启辙'),('能经220','王槟铠'),('能经220','王鑫达'),('能经220','葛志灏'),('能经220','王旭宁'),('能经220','王哲'),('能经220','黄峻晗'),('能经220','金煜卓'),('能经220','欧阳左悰'),('能经220','许怡敏'),('环境212','朱洪赋'),('环境212','刘款款'),('环境212','王立钤'),('环境212','尼扎米丁·黎瓦依丁'),('环境212','谭依涵'),('环境212','刘昌尧'),('环境212','付宇强'),('环境212','张展锋'),('环境212','李欣蓉'),('环境212','史润畅'),('环境212','薛臻屹'),('环境212','安黔峰'),('环境212','刘方伟'),('环境212','马艺萌'),('环境212','刘芷硕'),('环境212','王浩'),('环境212','刘鑫莹'),('环境212','于连超'),('环境212','周炜'),('环境212','游卓'),('环境212','金翔宇'),('环境212','李佳颖'),('能环试验2205','肖鑫'),('安全210','石友'),('安全210','熊铭钦'),('安全210','裴科霖'),('安全210','索朗维色'),('安全210','庄铖嵩'),('安全210','刘京'),('环境212','傅子瑞'),('环境212','余璇'),('能源202','孙淳凯'),('能源202','汉栋博'),('能源202','郭嘉宁'),('能源202','白瑞涛'),('能源202','罗圣杰'),('能源202','曹俊杰'),('能源202','靳宇豪'),('能源202','程效鹏'),('能源202','邹武凡'),('能源202','黄开灿'),('能源202','王培尧'),('能源202','赵思茗'),('能源202','肖乐天'),('能源202','施淇元'),('能源202','凯赛尔'),('能源202','曾颂曦'),('能源202','刘林风'),('安全200','杨岑'),('安全200','赵东吉'),('安全200','卢唐毅'),('安全200','顾宇欣'),('安全200','李嘉旭'),('安全200','虢长民'),('安全200','王孟欢'),('安全200','秦伟豪'),('安全200','宫颢'),('安全200','朱玮'),('安全200','金高枫'),('安全200','饶宇辰'),('安全200','卢芃伯'),('安全200','蒙全鑫'),('安全200','杨一帆'),('安全200','禹振国'),('安全200','马庆'),('安全200','林旭幸'),('安全200','陈鸣锋'),('安全200','刘尚霄'),('安全200','胡明阳'),('安全200','李晓鑫'),('安全200','卢涛'),('安全200','张世潼'),('安全200','张雨婷'),('安全200','侯星淳'),('安全200','吴奕帆'),('能源203','顾姚昱'),('能源203','陈德楷'),('能源203','赵义举'),('能源203','莫锦烨'),('能源203','杨钰驰'),('能源203','盛思琦'),('能源203','马卓阳'),('能源203','高永亮'),('能源203','姜瀚霖'),('能源203','苏清斌'),('能源203','牛英杰'),('能源203','胡嘉亮'),('能源203','梁力文'),('能源203','刘相君'),('能源203','朱煜骁'),('能源203','陈彦宇'),('能源203','刘阳'),('能源203','陈秋生'),('能源203','范北昆'),('能环试验2201','侯佩嘉'),('能环试验2201','赵乐颜'),('能环试验2201','温闰泽'),('能环试验2201','尹捷'),('能环试验2201','魏礼民'),('能环试验2201','廖元昊'),('能环试验2201','吕乔松'),('能环试验2201','李瑞凡'),('环境203','彭怡然'),('环境203','郭利涛'),('环境203','林侃'),('环境203','王湘粤'),('环境203','宋子昂'),('环境203','张琦'),('环境203','蒋璐'),('环境203','海尼木古丽·玉苏甫'),('能环试验2201','袁嘉琪'),('能环试验2204','王淇萱'),('能环试验2204','余彦蓉'),('能环试验2204','程茜彤'),('能环试验2204','栗欣'),('能环试验2204','罗怡婷'),('能环试验2204','屠雨涵'),('能环试验2204','沈然'),('能环试验2204','杨浩'),('能环试验2204','赵烁'),('能环试验2204','王振远'),('能环试验2204','姚禹豪'),('能环试验2204','陈雯轩'),('能环试验2204','侯翔皓'),('能环试验2204','刘新培'),('能环试验2204','姚骁'),('能环试验2204','王文强'),('能环试验2204','吴忠轩'),('能环试验2204','张颢严'),('能环试验2204','张永俊'),('能环试验2204','李温涛'),('能环试验2204','王鹏权'),('能环试验2204','吾木赛丽曼·麦麦提'),('能源211','张芷晴'),('能源211','王元元'),('能源211','李金鸯'),('能源211','徐小越'),('能源211','赵彬弘'),('能源211','王光华'),('能源211','覃红亮'),('能源211','夏奕'),('能源211','李南星'),('能源211','罗溢'),('能源211','张扬'),('能源211','朱文强'),('能源211','孙哲豪'),('能源211','张顺朋'),('能源211','周威'),('能源211','张汉文'),('能源211','张丽闯'),('能环试验2203','单姝静'),('能环试验2203','娜孜拉'),('能环试验2203','覃诗琪'),('能环试验2203','黄培'),('能环试验2203','邹承汐'),('能环试验2203','张城玮'),('能环试验2203','何宇轩'),('能环试验2203','姜听栩'),('能环试验2203','傅宇凡'),('环境212','张帆'),('环境202','福扎拉'),('环境202','张楚楚'),('环境202','王珂纯'),('环境202','张文琪'),('环境202','张萌'),('环境202','鲁昊祥'),('环境202','郭乐'),('环境202','杨天策'),('环境211','谷语'),('环境211','张珺绮'),('环境211','董丽晴'),('环境211','徐逸凡'),('环境211','张建桦'),('环境211','于航'),('环境211','赵祖炀'),('环境211','尚珈宇'),('环境211','姜佳岐'),('环境211','施洋'),('环境211','王皓田'),('环境211','史俊硕'),('环境211','张凯'),('环境211','李响'),('环境211','韩思桐'),('环境211','赵鑫'),('环境211','崔文铎'),('环境211','赵洋洋'),('环境211','张瀚森'),('环境211','李宇杰'),('环境211','芦文博'),('环境211','吕同琳'),('环境211','康杰'),('环境211','邵亚斌'),('环境211','徐智浩'),('环境211','孜拉莱·波拉提'),('能经210','顾昕怡'),('能经210','付莉妍'),('能经210','林乐松'),('能经210','张嘉亮'),('能经210','于易文'),('能经210','郭席良'),('能经210','严超骏'),('能经210','艾东正'),('能经210','徐云峰'),('能经210','陈昱皓'),('能经210','邱志涵'),('能经210','齐成浩'),('能经210','桑子炀'),('能经210','王晋'),('能经210','余佳禾'),('能经210','李琦'),('能经210','于翔海'),('能经210','梁思明'),('能经210','胡凯基'),('能经210','范宸豪'),('能经210','袁铮'),('能经210','于德旭'),('能经210','王棋奇'),('能经210','孙士祁'),('能经210','杜炜杰'),('能经210','王志贤'),('能经210','缪宇秋'),('能源201','薛瑞'),('能源201','李晨曦'),('能源201','黄垚'),('能源201','王峙超'),('能源201','赵雍强'),('能源201','郑颖'),('能源201','何冰冰'),('能源201','努尔兰尼别克·巴克尔'),('能源201','孔仲令'),('能源201','罗茂银'),('能源201','陈思集'),('能源201','滕涛'),('能源201','覃文瀚'),('能源201','孙绘迪'),('能源201','陈柳萍'),('能源201','蔡承霖'),('能源201','刘阳硕'),('能源201','佘建毅'),('能源201','邓紫杨'),('能源201','王松'),('能源201','陈宇杰'),('能源201','赵凯'),('能源201','苏照秦'),('能源201','张原野'),('能源201','陈志辉');
/*!40000 ALTER TABLE `wxx` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'qndxx'
--

--
-- Dumping routines for database 'qndxx'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-06-01 17:02:18
